stone = [[0, 0, 0, 0, 0, 0, 0, 0, 0],\
        [0, 1, 0, 1, 2, 1, 2, 1, 0],\
        [0, 2, 1, 1, 1, 2, 2, 0, 0],\
        [0, 0, 2, 2, 2, 1, 0, 2, 0],\
        [0, 0, 0, 0, 0, 1, 0, 2, 1],\
        [0, 0, 0, 2, 0, 1, 2, 1, 0],\
        [0, 0, 0, 2, 1, 0, 1, 1, 0],\
        [0, 0, 0, 1, 1, 0, 0, 0, 0],\
        [0, 0, 0, 0, 2, 2, 2, 0, 0]]
while True:
    X = int(input("X축 좌표값을 입력하세요(1 ~ 9, 종료 시 -1 입력) : "))
    if X == -1:
        break
    
    Y = int(input("Y축 좌표값을 입력하세요(1 ~ 9, 종료 시 -1 입력) : "))
    if Y == -1:
        break
    
    if stone[Y - 1][X - 1] == 1:
        print("흑돌")
    elif stone[Y - 1][X - 1] == 2:
        print("백돌")
    else:
        print("돌없음")
        
print("종료되었습니다.")